import streamlit as st

st.markdown(
    f"""
        <style>
        .stApp {{
        background-image: url("https://wallpapers.com/images/featured-full/plain-black-background-02fh7564l8qq4m6d.jpg");
        background-attachment: fixed;
        background-size: cover;
        /* opacity: 0.3; */
        }}
        </style>
        """,
    unsafe_allow_html=True
)
#-------------------------------------------------background---------------------------------------------------------------------------------------

tab1, tab2, tab3 = st.tabs(["instagram","ประวัติ","รีวิว"])

with tab1:
    st.header(":red[BOX NEWS]")

    st.title(':red[Top 10 อันดับบุคคลใน Instagram ผู้ติดตามมากที่สุดในโลก ปี 2023] ')
    st.markdown(":red[Instagram เป็นช่องทางโซเชียลมีเดียโดดเด่นที่สุดสำหรับความร่วมมือของแบรนด์กับอินฟลูเอนเซอร์ ทั้งที่เป็นดารานักแสดง นักร้อง หรือนักกีฬาล่าสุด Instagram ของลิซ่า ลลิษา มโนบาล ได้มีผู้ติดตามแตะหลัก 100 ล้านสำเร็จ ซึ่งเป็นไอดอลเคป๊อปคนแรกและเป็นศิลปินหญิงฝั่งเอเชียคนแรกที่ทำได้ ตอกย้ำความโด่งดังบนเส้นทางระดับโลกของเธออีกหนึ่งขั้นเลยก็ว่าได้ทีนี้มาดูกันว่า Instagram ที่มียอดผู้ติดตามมากที่สุด 10 อันดับเป็นใคร มีผู้ติดตามเท่าไหร่ ไปดูกัน ต้องบอกก่อนว่าไม่นับแอคเคาท์ Instagram ที่มีผู้ติดตามสูงสุดถึง 665 ล้านฟอลโลเวอร์]")
    st.image('Screenshot 2024-03-06 201926.png', caption='Picture by brandage')

    st.title(':orange[อันดับ1]')
    st.page_link("https://www.instagram.com/cristiano/", label=":red[Cristiano Ronaldo]")
    st.image('cr.png')  

    st.title(':orange[อันดับ2]')
    st.page_link("https://www.instagram.com/leomessi/", label=":red[Lionel Messi]")
    st.image('lm.png')
    
    st.title(':orange[อันดับ3]')
    st.page_link("https://www.instagram.com/selenagomez/", label=":red[Selena Gomez]")
    st.image('sg.png')
    
    st.title(':orange[อันดับ4]')
    st.page_link("https://www.instagram.com/kyliejenner/", label=":red[Kendall Jenner]")
    st.image('kl.png')
    
    st.title(':orange[อันดับ5]')
    st.page_link("https://www.instagram.com/therock/", label=":red[Dwayne Johnson]")
    st.image('tr.png')
    
    st.title(':orange[อันดับ6]')
    st.page_link("https://www.instagram.com/arianagrande/", label=":red[Ariana Grande]")
    st.image('ag.png')
    
    st.title('[:orangeอันดับ7]')
    st.page_link("https://www.instagram.com/kimkardashian/?hl=th", label=":red[Kim Kardashian]")
    st.image('kk.png')
    
    st.title(':orange[อันดับ8]')
    st.page_link("https://www.instagram.com/Beyonce/", label=" :red[Beyoncé Giselle Knowles-Carter]")
    st.image('b.png')
    
    st.title(':orange[อันดับ9]')
    st.page_link("https://www.instagram.com/khloekardashian/?hl=th", label=":red[Khloé Kardashian]")
    st.image('kh.png')
    
    st.title(':orange[อันดับ10]')
    st.page_link("https://www.instagram.com/kendalljenner/", label=":red[Kendall Jenner]")
    st.image('kd.png')
#-------------------------------------------------------------------------------------------------------------------------------------------------
with tab2:
    st.header(":red[ประวัติของผู้ติดตามที่มากที่สุดใน instagram]")
    st.image("AW-Ronaldo-01-2048x1152.jpg")
    st.title(":red[ประวัติของ Cristiano Ronaldo สู่เส้นทางนักฟุตบอลทีมชาติโปรตุเกส]")
    st.markdown(":red[เปิดประวัตินักฟุตบอลดาวยิงแห่งทีมชาติโปรตุเกส Cristiano Ronaldo (คริสเตียโน โรนัลโด) ทีมอันดับ 5 ของโลกจากการจัดอันดับของ Fifa World Ranking จากที่เล่นฟุตบอลในนามของเยาวชนเข้าสู่เส้นทางการเป็นนักฟุตบอลอาชีพของ Ronaldo พร้อมกับบทบาทเจ้าของธุรกิจอีกมากมาย จะเป็นอย่างไรนั้น เราตามไปดูประวัติของเขากันเลยครับ]")
    
    st.title(":red[ประวัติส่วนตัว Ronaldo จุดเริ่มต้นในการเล่นฟุตบอล]")
    st.image("AW-Ronaldo-02-2048x2048.jpg")
    st.markdown(":red[Cristiano Ronaldo คริสเตียโน โรนัลโด มีชื่อเต็มว่า Cristiano Ronaldo dos Santos Aveiroเกิดวันที่ 5 กุมภาพันธ์ 1985ส่วนสูง 185 เซนติเมตร (6 ฟุต 1 นิ้ว)เป็นลูกชายของนายชูเซ ดีนิช อาไวรู กับนางมาเรีย ดูโลริช อาไวรู โดย Ronaldo เป็นลูกชายคนเล็กในพี่น้อง 4 คน มีพี่ชาย 1 คน พี่สาว 2 คนCristiano Ronaldo ชื่อนี้มีที่มาจากพ่อของเขาเป็นผู้ตั้งให้ ได้รับแรงบันดาลใจมาจากชื่อของ Ronald Wilson Reagan อดีตประธานาธิบดีแห่งสหรัฐอเมริกา ซึ่งเป็นบุคคลที่พ่อของ Ronaldo ชื่นชอบตั้งแต่ที่ยังเป็นนักแสดงอยู่ครอบครัวของ Ronaldo อาศัยอยู่ที่เมืองฟุงชาล, มาเดรา ประเทศโปรตุเกส ซึ่งเป็นเขตที่มีประชากรยากจนอาศัยอยู่มาก ซึ่ง Ronaldo เองก็ได้เริ่มเล่นฟุตบอลจากที่นี่ โดยช่วงวัยเด็กเขาชอบเล่นฟุตบอลมาก บริเวณตามถนน พอเข้าอายุ 6 ขวบ เขาเริ่มต้นเล่นฟุตบอลอย่างจริงจังในทีมชุดใหญ่ของทีมอังดูริญญา (Andorinha) ในนามทีมเยาวชนโดยการชักชวนของญาติเขาที่อยู่ในทีมนี้ ก่อนที่จะย้ายไปอยู่กับสโมสรฟุตบอลนาซีอองนัล (Nacional) ในปี 1995 โดยมีการจ่ายค่าตัวเป็นชุดฟุตบอลและลูกบอล]")
    
    st.title(":red[เส้นทางสู่ฟุตบอลอาชีพของ Ronaldo]")
    st.image("AW-Ronaldo-03-2048x2048.jpg")
    st.markdown(":red[หลังจากย้ายมาเล่นกับนาซีอองนัล ในปี 1995-1997 ต่อมาเขาได้เซ็นสัญญากับสโมสรยักษ์ใหญ่อย่าง สปอร์ติงลิสบอน (Sporting Lisbon) ในปี 1997 – 2002 ซึ่ง Ronaldo ได้ลงเล่นในทีมชุดใหญ่ของสปอร์ติงเป็นครั้งแรก ก้าวติดทีมชาติโปรตุเกสชุดอายุต่ำกว่า 17 ปี ในศึกชิงแชมป์ยุโรปหลังจากนั้น Ronaldo ได้ถูกพิจารณาย้ายตัวไปอยู่กับแมนเชสเตอร์ยูไนเต็ด (Manchester United) โดย อเล็กซ์ เฟอร์กูสัน ซื้อตัวเขามาด้วยจำนวนเงิน 12.5 ล้านปอนด์ ในฤดูกาล 2003 – 2004 ทำให้ได้แชมป์ เอฟเอคัพ ซึ่งเป็นรางวัลแรกอันทรงเกียรติของเขาเองอีกด้วย พร้อมรับรางวัลผู้เล่นยอดเยี่ยมแห่งปีของแมนเชสเตอร์ ยูไนเต็ด (Sir Matt Busby Player of the Year) ประจำฤดูกาล 2003/04Ronaldo ร่วมทีมกับแมนเชสเตอร์ยูไนเต็ดในปี 2003 จนถึงปี 2009 หลังจากนั้นได้ย้ายไปเล่นให้กับสโมสรฟุตบอลเรอัลมาดริด (Real Madrid) ในตำแหน่งกองหน้า และเป็นกัปตันทีมของฟุตบอลทีมชาติโปรตุเกส ด้วยค่าตัว 80 ล้านปอนด์ โดยได้รับค่าจ้างในการลงเล่นกับ Real Madrid จำนวน 12 ล้านปอนด์ต่อปี ทำให้ Ronaldo เป็นนักเตะที่มีค่าเหนื่อยมากที่สุดในโลกRonaldo อยู่สโมสรฟุตบอลเรอัลมาดริด จนถึงปี 2018 แล้วย้ายไปสโมสรยูเวนตุส (Juventus) ในกัลโชเซเรียอา อิตาลี โดยสวมเสื้อหมายเลข 7 จึงมีชื่อเรียกย่อว่า CR7 (C มาจาก Cristiano, R มาจาก Ronaldo ส่วนเลข 7 มาจาก เบอร์เสื้อประจำตัว) สร้างตำนานแข้งซูเปอร์สตาร์ทีม ‘ม้าลาย’ ยูเวนตุส คนใหม่ โดยได้ทำสถิติกลายเป็นนักฟุตบอลคนแรกของโลกที่สามารถโกยรายได้เกิน 1 พันล้านดอลลาร์สหรัฐฯปัจจุบัน CR7 ได้รับค่าตัวจากทีมยูเวนตุสสัปดาห์ละ 5 แสนยูโร ตกปีละ 30 ล้านยูโร ถือเป็นหนึ่งในแข้งที่รับค่าตัวสูงเป็นอันดับต้น ๆ ของโลกเลยทีเดียว โดยในปี 2019 ที่ผ่านมา Ronaldo กัปตันทีมชาติโปรตุเกสยังกลายเป็นนักฟุตบอลที่ทำรายได้จากอินสตาแกรมสูงที่สุดอีกด้วย หลังจากกวาดไป 47.8 ล้านเหรียญดอลลาร์สหรัฐฯ]")
    
    st.title(":red[Lionel Messi]")
    st.image("Lionel Messi .jpg")
    st.markdown(" :red[ครอบครัวของ เมสซี่]")
    
    st.markdown(":red[เมสซี่ เป็นบุตรชายคนสุดท้องในจำนวนพี่น้อง 4 คน (พี่ชาย 2 พี่สาว 1) ของนาย คอร์เค โอราเซียว เมสซี่ คนงานโรงงาน และนางเซเลีย มารีอา กุกซิตตีนี พนักงานทำความสะอาดนอกเวลา โดยครอบครัวฝ่ายบิดาได้อพยพมาจากอิตาลี แม้เกิดในอาร์เจนตินา แต่ เมสซี่ และครอบครัวก็ได้ย้ายไปอยู่ที่ประเทศสเปนหลังจากที่เขาเล่นฟุตบอลให้กับทีมเยาวชนของ บาร์เซโลนา ในปี 2000ปัจจุบัน เมสซี่ พูดภาษาสเปนในสำเนียงชาวโรซาริโอ และยังคงไปเยี่ยมบ้านเกิดอยู่บ่อย ๆ เมสซี่ ยังคงติดต่อเพื่อน ๆ ที่โรซาริโอด้วยการส่งข้อความ และพูดคุยทางโทรศัพท์เป็นครั้งคราว นอกจากนี้เขายังเก็บบ้านเก่าที่โรซาริโอเอาไว้ แม้จะไม่มีคนอาศัยอยู่ก็ตามความสัมพันธ์ในครอบครัวของเมสซี่ นับได้ว่าอบอุ่นเป็นอย่างดี ในช่วงที่เขากลับบ้านเกิดมาฝึกซ้อมร่วมกับ ทีมชาติอาร์เจนตินา เมสซี่ ยอมเดินทางไป-กลับเที่ยวละ 3 ชั่วโมง จากสนามฝึกซ้อมในกรุงบัวโนสไอเรสเพื่อกลับมากินข้าวกับครอบครัวในโรซาริโอ อยู่ค้างคืนที่บ้านแล้วจึงออกเดินทางแต่เช้าเพื่อไปฝึกซ้อมอีกครั้ง]")
    
    st.markdown(":red[เส้นทางลูกหนังของ เมสซี่]")
    st.markdown(":red[เมสซี่ เริ่มเล่นกีฬาฟุตบอลมาตั้งแต่อายุ 5 ขวบ โดยได้เข้าอยู่ในสโมสรเล็ก ๆ ที่ชื่อว่า กรานโดลี่ โดยมีพ่อเป็นโค้ชให้ จนเมื่อปี 1995 เมสซี่ จึงได้ย้ายไปอยู่กับสโมสรที่ใหญ่กว่าและเป็นสโมสรในระดับลีกสูงสุดของอาร์เจนตินา ชื่อสโมสร นีเวลล์ส โอลด์ บอยส์ทว่าการเอาดีด้านฟุตบอลของ เมสซี่ ไม่ราบรื่นอย่างที่คิด เมื่ออายุได้ 11 ปี เขาประสบภาวะขาดฮอร์โมนการเจริญเติบโต ทำให้รูปร่างของเขาเล็กกว่าที่ควรจะเป็น จนเกือบไม่ได้ไปต่อในเส้นทางการค้าแข้ง เนื่องจาก นีเวลล์ส โอลด์ บอยส์ รวมถึง ริเวอร์เพลท สโมสรดังของอาร์เจนตินาที่ให้ความสนใจคว้าตัวเขา ไม่มีเงินสำหรับที่จะจ่ายค่ารักษาดังกล่าวให้กับ เมสซี่ ประมาณ 900 เหรียญสหรัฐฯ (ประมาณ 3 หมื่นบาท) เพราะว่ากำลังเกิดวิกฤตเศรษฐกิจในประเทศแต่แล้วฝีเท้าของ เมสซี่ ก็ไปเข้าตา การ์เลส เรซัค ผู้อำนวยการด้านกีฬาของสโมสร บาร์เซโลนา จึงยื่นข้อเสนอให้ เมสซี่ ย้ายไปเล่นในสเปน พร้อมยินดีจ่ายเงินค่ารักษาให้ จากนั้น เมสซี่ พร้อมครอบครัวจึงได้ย้ายไปอยู่สเปน เพื่อฝึกฝนฝีเท้าอย่างจริงจังในฐานะสมาชิกทีมเยาวชนของ บาร์เซโลนาแต่แล้วฝีเท้าของ เมสซี่ ก็ไปเข้าตา การ์เลส เรซัค ผู้อำนวยการด้านกีฬาของสโมสร บาร์เซโลนา จึงยื่นข้อเสนอให้ เมสซี่ ย้ายไปเล่นในสเปน พร้อมยินดีจ่ายเงินค่ารักษาให้ จากนั้น เมสซี่ พร้อมครอบครัวจึงได้ย้ายไปอยู่สเปน เพื่อฝึกฝนฝีเท้าอย่างจริงจังในฐานะสมาชิกทีมเยาวชนของ บาร์เซโลนา]")
    
    st.title(":red[Selena Gomez]")
    st.markdown("ประวัติ Selena Gomez")
    st.markdown(":red[Selena Gomez (เซเลนา โกเมซ) หรือชื่อจริงคือ Selena Marie Gomez (เซเลนา มารี โกเมซ) เกิดวันที่ 22 กรกฎาคม ค.ศ. 1992 เป็นนักร้องและนักแสดงหญิงชาวอเมริกัน โดยเกิดและเติบโตที่ แกรนด์แพรรี รัฐเท็กซัส สหรัฐอเมริกา ผลงานแจ้งเกิดในวงการของเธอก็คือผลงานการแสดงซีรีส์เรื่อง Barney & Friends เมื่อช่วงปี 2000 ส่วนผลงานที่โดดเด่นสร้างชื่อเสียงให้กับเธอเป็นอย่างมาก คือซีรีส์ทางโทรทัศน์เรื่อง ครอบครัวพลังโอมเพี้ยง! (Wizards of Waverly Place) ซึ่งเธอได้รับบทของ อเล็กซ์ รุสโซ ทางช่องดิสนีย์แชนแนลนอกจากผลงานด้านการแสดงแล้ว ในส่วนของผลงานเพลง Selena Gomez ได้ร่วมงานกับวงดนตรี The Scene ในชื่อกลุ่มว่า “Selena Gomez & The Scene” โดยเซ็นสัญญากับค่ายเพลง Hollywood Records และออกอัลบั้มด้วยกันถึง 3 อัลบั้ม คือ Kiss & Tell, A Year Without Rain และ When The Sun Goes Down หลังจากนั้นก็ได้แยกกลุ่มกันไป ซึ่งในปัจจุบัน Selena Gomez กลายเป็นศิลปินเดี่ยว โดยที่ “Revival” เป็นอัลบั้มชุดแรกของเธอภายใต้สังกัด Interscope ซึ่งอัลบั้มแรกของเธอได้รับการตอบรับที่ดีและได้รับคำชื่นชมอย่างมาก]")
    st.image("cpa.jpg")
    
    st.title(":red[Kendall Jenner]")
    st.image("jj.jpg")
    st.markdown(":red[คนดัลล์ นิโคล เจนเนอร์ (อังกฤษ: Kendall Nicole Jenner , เกิด 3 พฤศจิกายน ค.ศ. 1995) เป็นนักเดินแบบ บุคคลที่มีชื่อเสียงในวงสังคม และสื่อชาวอเมริกัน เป็นบุตรของคริส เจนเนอร์ และเคตลิน เจนเนอร์ เป็นที่รู้จักจากรายการโทรทัศน์เรียลริตีโชว์ ตามติดไปกับตระกูลคาร์ดาเชียน (Keeping Up with the Kardashians) เจนเนอร์เริ่มเข้าสู่วงการนักเดินแบบเมื่ออายุ 14 ปี ในสัปดาห์แฟชั่นนิวยอร์ก มิลาน และปารีส เจนเนอร์ยังทำเคมเปญให้กับนิตยสารเลิฟ และโว้ก ฉบับนานาชาติ และเป็นทูตตราสินค้าให้กับเอสเตลอเดอร์ นอกจากนี้เจนเนอร์ติดอันดับที่ 16 ของนิตยสารฟอบส์ ในปี ค.ศ. 2015 จากรายได้มากที่สุดในอาชีพของเธอจำนวน 4 ล้านดอลลลาร์สหรัฐต่อปี]")
    
    st.markdown(":red[เข้าสู่วงการ]")
    st.markdown(":red[ในปี ค.ศ. 2007 เคนดัลล์ เจนเนอร์พร้อมด้วยพ่อแม่และพี่น้องของเธอ ไคลี เจนเนอร์, คอร์ตนีย์ คาร์เดเชียน, คิม คาร์เดเชียน, โคลอี คาร์เดเชียน และ ร็อบ คาร์เดเชียน ปรากฏตัวครั้งแรกในรายการเรียลลิตีโชว์ ตามติดไปกับตระกูลคาร์ดาเชียน (Keeping Up with the Kardashians) ซึ่งเป็นรายการบันทึกเรื่องราวชีวิตส่วนตัวและอาชีพของสมาชิกในครอบครัวของพวกเธอ ซึ่งได้รับความนิยมและประสบผลสำเร็จ ออกฉายทางช่อง E! นอกจากนี้ยังมีรายการในลักษณะแบบเดียวกันทั้ง Kourtney and Kim Take Miami, Khloé & Lamar, Kourtney and Kim Take New York และ Kourtney and Khloé Take The Hamptons โดยเคนดัลล์ เจนเนอร์ ก็ถูกรับเชิญในหลาย ๆ ตอน]")
    st.markdown(":red[อาชีพนักเดินแบบ]")
    st.markdown(":red[การเปิดตัวและความก้าวหน้าเคนดัลล์ เจนเนอร์ เริ่มเข้าสู่วงการนักเดินแบบตอนอายุ 13 ปีจากการเซ็นสัญญาวิลเฮลมินาโมเดลส์ เมื่อวันที่ 12 กรกฎาคม ค.ศ. 2009 เธอเริ่มงานแรกจาก Rocker Babes with a Twist แคมเปญของฟอเรเวอร์ 21 ในเดือนธันวาคม ค.ศ. 2009 และมกราคม ค.ศ. 2010 และถ่ายแฟชั่นนิตยสารทีนโว้กเมื่อวันที่ 19 เมษายน ค.ศ. 2010]")
    
    st.title(":red[Dwayne Johnson]")
    st.image("dw.jpg")
    st.markdown(":red[The Rock ทายาทนักมวยปล้ำ]")
    st.markdown(":red[ดเวย์น จอห์นสัน (Dwayne Johnson) เกิดเมื่อปี 1972 ที่รัฐแคลิฟอร์เนีย เขาเป็นลูกชายของร็อคกี้ จอห์นสัน (Rocky Johnson) นักมวยปล้ำแอฟริกัน-อเมริกันคนแรกที่คว้าแชมป์แบบแท็กทีม และยังเป็นหลานชายของปีเตอร์ มายเวีย (Peter Maivia) นักมวยปล้ำเชื้อสายซามัวอีกด้วย จึงไม่น่าแปลกใจที่ดเวย์นจะเติบโตมากับธรรมชาติของการเป็นนักมวยในช่วงวัยเด็ก ดเวย์นอาศัยอยู่กับคุณแม่ของเขาที่นิวซีแลนด์ก่อนที่เขาจะย้ายกลับมาอยู่ที่อเมริกากับคุณพ่อ แต่ด้วยความที่กีฬามวยปล้ำที่ยังไม่เป็นที่นิยมนักทำให้รายได้ของครอบครัวค่อนข้างฝืดเคือง ดเวย์นในวัย 14 ปี จึงเลือกที่จะออกตระเวนฉกชิงวิ่งราวกับกลุ่มเพื่อนแล้วนำไปขายและหัดปลอมเช็คไปแลกเงินสดอีกด้วย]")
    st.markdown(":red[Dwayne Johnson ในฐานะนักกีฬาอเมริกันฟุตบอล]")
    
    st.markdown(":red[เมื่ออายุได้ 16 ปี ดเวย์นที่กำลังใช้ชีวิตโลดโผนอยู่นั้นก็มีโอกาสได้เริ่มเล่นกีฬาอเมริกันฟุตบอลตามคำแนะนำของครูประจำโรงเรียนเนื่องจากเขามีร่างกายที่ใหญ่โตและแข็งแกร่งบวกกับที่นิสัยก้าวร้าวดุดัน นั่นจึงทำให้เขาเป็นดาวรุ่งที่น่าจับตามองอย่างมากในเวลานั้นดเวย์นจึงได้รับโควต้าจากมหาวิทยาลัยชื่อดังมากมายเพราะใครๆ ก็อยากได้ตัวเขาไปร่วมทีม ท้ายที่สุดเขาตัดสินใจเข้าร่วมทีม Miami Hurricanes ของมหาวิทยาลัยไมอามีโดยลงเล่นในตำแหน่ง Defensive Lineman ซึ่งเขาก็โชว์ฟอร์มได้อย่างยอดเยี่ยมจากการทำสถิติแท็กเกิลสำเร็จ 77 ครั้งในการลงสนาม 39 เกม และสามารถพาทีมคว้าแชมป์ระดับประเทศในปี 1991 ได้สำเร็จ] ")
    st.markdown(":red[อนาคตสุดริบหรี่กับเงิน 7 ดอลล่าร์]")
    st.markdown(":red[อนาคตช่างดูสดใส อย่างไรก็ตามดเวย์นต้องเผชิญกับอาการบาดเจ็บที่ไหล่อย่างหนักซึ่งทำให้ระยะเวลาในการลงเล่นของเขาลดลงไปด้วย ดเวย์นจึงดีไม่พอที่ถูกดราฟต์ไปเล่น NFL ท้ายที่สุดเขาตัดสินใจไปเล่นให้ทีม Calgary Stampede ที่ประเทศแคนาดา แต่อยู่ไปได้ 2 เดือน เขาก็ถูกตัดออกจากทีม หลังถูกตัดออกจากทีม ดเวย์นก็เดินทางกลับไมอามี่พร้อมกับเรียกพ่อของเขาให้มารับที่สนามบิน เขานั่งรถกลับพร้อมกับคิดว่าอนาคตในวงการอเมริกันฟุตบอลช่างริบหรี่เหลือเกิน เขาหยิบกระเป๋าตังของเขาออกดูและพบว่าเขามีเงินติดตัวเพียงแค่ 7 ดอลลาร์เท่านั้น ทันใดนั้นเขาก็บอกตัวเองว่าจะต้องทำทุกวิถีทางให้มีเงินมากกว่านี้]")
    st.markdown(":red[ผันตัวเข้าสู่วงการมวยปล้ำ]")
    st.markdown(":red[ไม่นานหลังจากนั้น เดอะร็อคก็ขอร้องให้พ่อบังเกิดเกล้าของเขาอย่าง ร็อกกี้ จอห์นสัน ถ่ายทอดศิลปะการต่อสู้ทั้งหมดให้และช่วยให้เขาเข้าสู่วงการมวยปล้ำให้ได้ แม้ร็อกกี้จะไม่เต็มใจช่วยในตอนแรก แต่ในที่สุด ดเวย์นก็ได้ขึ้นสังเวียนอาชีพครั้งแรกในศึก WWE ปี 1996 กับ Brooklyn Brawler ด้วยฉายา ‘ร็อกกี้ มายเวีย’ (Rocky Maivia) ที่ได้จากการเอาชื่อของคุณพ่อและคุณตาของเขามารวมกันหลังจากขึ้นสังเวียนไปได้สักพัก ดเวย์นก็สามารถคว้าแชมป์ USWA แบบแท็กทีมร่วมกับ Bart Sawyer มาได้สำเร็จ นั่นจึงทำให้ WWE จัดการเซ็นสัญญากับดเวย์นพร้อมกับฉายาใหม่อย่าง Flex Kavana หนึ่งปีต่อมา ดเวย์นก็เข้ามาเป็นผู้นำของทีม The Nation of Domination พร้อมกับเปลี่ยนฉายาของตัวเองอีกครั้งเป็น ‘เดอะร็อค’ (The Rock) เดอะร็อคใช้เวลาไม่นานก็สามารถคว้าแชมป์ WWE มาครองได้สำเร็จ เขากลายเป็นแชมป์โลกที่อายุน้อยที่สุดในขณะนั้นด้วยวัย 26 ปี ด้วยทักษะการต่อสู้ที่แข็งแกร่ง บุคลิกที่น่าจดจำ มีท่าไม้ตายเฉพาะตัวอย่าง Rock Bottom และ People’s Elbow รวมทั้งทักษะการเอ็นเตอร์เทนคนดูที่เร้าใจ ทำให้เขาได้รับฉายา The People’s Champ มาครองได้อย่างรวดเร็วตลอดระยะเวลา 9 ปี เดอะร็อคสามารถกวาดแชมป์มาได้ทั้งหมด 17 รายการ เขาเป็นแชมป์โลก 9 สมัย โดยคว้าแชมป์โลกของ WWE มาได้ 7 สมัย และคว้าแชมป์โลก WCW มาได้ 2 สมัย รวมไปถึงแชมป์อื่นๆ ได้แก่ แชมป์อินเตอร์คอนติเนนทัล 2 สมัย แชมป์โลกแท็กทีมของ WWE 5 สมัย และเป็นผู้ชนะใน The Royal Rumble ในปี 2000โอกาสสู่นักแสดงในขณะที่กำลังรุ่งโรจน์กับมวยปล้ำ เดอะร็อคก็ได้มีโอกาสก้าวเท้าเข้าสู่วงการมายาเช่นกัน เขาได้รับเลือกให้มารับบท Scorpion King ในภาพยนตร์เรื่อง The Mummy Returns แต่มีแอร์ไทม์เพียงไม่กี่นาทีเท่านั้น แต่นี่ก็ถือว่าเป็นก้าวแรกที่ยิ่งใหญ่ของการเป็นนักแสดงภาพยนตร์บล็อกบัสเตอร์อย่างแท้จริง เพราะหลังจากนั้นเดอะร็อคได้กลับมารับบทนี้อีกครั้งในเรื่อง The Scorpion King ซึ่งเป็นภาคแยกของภาพยนตร์เรื่องก่อนตามคำเรียกร้องของแฟนๆ ซึ่งเขาได้รับค่าตัวไปเต็มๆ ถึง 5.5 ล้านเหรียญหลังจากนั้นเขาก็รับงานแสดงสลับกับมวยปล้ำมาตลอด จนกระทั่งเขาได้เล่นหนังเรื่อง Walking Tall ซึ่งทำให้คนดูเริ่มจดจำเขาในฐานะนักแสดงมากขึ้น เดอะร็อคจึงตัดสินใจยุติบทบาทนักมวยปล้ำอย่างเป็นทางการในปี 2004 ซึ่งเป็นช่วงที่สัญญาของเขากับ WWE หมดลงเช่นกันพอประกาศลงจากเวทีมวยปล้ำ งานแสดงก็ข้ามาหาเดอะร็อคไม่หยุดหย่อนทั้งในบทหลักและบทรอง อย่างเช่นภาพยนตร์เรื่อง Be Cool (2005), Doom (2005), The Game Plan (2007), Get Smart (2008) หรือ Faster (2010) ]")
    st.markdown(":red[โอกาสสู่นักแสดง]")
    st.markdown(":red[นขณะที่กำลังรุ่งโรจน์กับมวยปล้ำ เดอะร็อคก็ได้มีโอกาสก้าวเท้าเข้าสู่วงการมายาเช่นกัน เขาได้รับเลือกให้มารับบท Scorpion King ในภาพยนตร์เรื่อง The Mummy Returns แต่มีแอร์ไทม์เพียงไม่กี่นาทีเท่านั้น แต่นี่ก็ถือว่าเป็นก้าวแรกที่ยิ่งใหญ่ของการเป็นนักแสดงภาพยนตร์บล็อกบัสเตอร์อย่างแท้จริง เพราะหลังจากนั้นเดอะร็อคได้กลับมารับบทนี้อีกครั้งในเรื่อง The Scorpion King ซึ่งเป็นภาคแยกของภาพยนตร์เรื่องก่อนตามคำเรียกร้องของแฟนๆ ซึ่งเขาได้รับค่าตัวไปเต็มๆ ถึง 5.5 ล้านเหรียญหลังจากนั้นเขาก็รับงานแสดงสลับกับมวยปล้ำมาตลอด จนกระทั่งเขาได้เล่นหนังเรื่อง Walking Tall ซึ่งทำให้คนดูเริ่มจดจำเขาในฐานะนักแสดงมากขึ้น เดอะร็อคจึงตัดสินใจยุติบทบาทนักมวยปล้ำอย่างเป็นทางการในปี 2004 ซึ่งเป็นช่วงที่สัญญาของเขากับ WWE หมดลงเช่นกันพอประกาศลงจากเวทีมวยปล้ำ งานแสดงก็เข้ามาหาเดอะร็อคไม่หยุดหย่อนทั้งในบทหลักและบทรอง อย่างเช่นภาพยนตร์เรื่อง Be Cool (2005), Doom (2005), The Game Plan (2007), Get Smart (2008) หรือ Faster (2010)] ")
    st.markdown(":red[นักแสดงพันล้าน]")
    st.markdown(":red[อย่างไรก็ตามภาพยนตร์ที่ประสบความสำเร็จเรื่องแรกของเขาก็คือการรับบท ลุค ฮ็อบส์ ใน Fast Five (2011) ที่กวาดรายได้ทั่วโลกไปถึง 626.1 ล้านเหรียญสหรัฐ โดยเดอะร็อคได้ค่าตัว 32.6 ล้านเหรียญสหรัฐ มากกว่านักแสดงหลักอย่าง วิน ดีเซลล์ หรือ พอล วอล์คเกอร์เสียอีก ซึ่งความสำเร็จนี้ยังต่อยอดไปถึงแฟรนไชส์ภาพยนตร์เร็วแรงทะลุนรกในภาคต่อๆ ไปอีกด้วยเดอะร็อคกลายมาเป็นนักแสดงแถวหน้าของฮอลลีวู้ดอย่างเต็มตัว ในปี 2016 เขาเป็นนักแสดงนำชายที่มีรายได้มากที่สุดในโลกกับจำนวนเงิน 64.5 ล้านเหรียญสหรัฐหรือราวๆ 2.1 พันล้านบาท จากการแสดงเรื่อง San Andreas, Central Intelligence, Baywatch และ The Fate of the Furious] ")
    st.image("rock.jpg")
    st.markdown(":red[นักแสดงแถวหน้าของฮอลลีวู้ด]")
    st.markdown(":red[ในช่วงหลังๆ เดอะร็อคก็ยังมีภาพยนตร์บล็อกบัสเตอร์ออกมาให้รับชมอย่างต่อเนื่องไม่ว่าจะเป็น ภาพยนตร์ที่สร้างมาจากเกมส์อย่าง Jumanji ทั้ง 2 ภาค และ Rampage ที่กวาดรายได้รวมกันเกิน 2 พันล้านเหรียญ หรือภาพยนตร์แอ็คชั่นอย่าง Skyscraper และ Hobb & Shaws ก็ทำรายได้รวมกันสูงเกินพันล้านเหรียญเช่นกันปัจจุบันเดอะร็อคก็ยังคงโลดแล่นอยู่ในฮอลลีวู้ดส์ เขาได้ร่วมงานกับนักแสดงมากฝีมืออย่าง ไรอัน เรย์โนลด์ส (Ryan Reynolds) และ กัล กาด็อต (Gal Gadot) ในเรื่อง Red Notice ซึ่งมีกำหนดฉายทาง Netflix ในวันที่ 5 พ.ย. ที่กำลังจะถึง นอกจากนั้นเขามีโปรเจกต์ก้าวเข้าสู่จักรวาล DC เป็นครั้งแรกกับบทบาท Black Adam ซึ่งมีกำหนดการฉายในเดือนเมษายนปี 2022  เดอะร็อคถูกประเมินทรัพย์สินไว้อยู่ที่ 400 ล้านเหรียญสหรัฐหรือราวๆ 1.3 หมื่นล้านบาท เขาถูกประเมินให้เป็นนักแสดงที่มีค่าตัวแพงที่สุดในโลก นับเป็นการเดินทางที่แสนจะยาวไกลเหลือเกิน จากนักกีฬาที่ดูหมดอนาคตสู่การเป็นนักแสดงอันดับต้นๆ ของโลก แต่ทั้งหมดนี้ใช่ว่าโชคชะตาจะเป็นสิ่งที่กำหนดเขาอย่างเดียว เพราะเขาก็เป็นคนที่กำหนดทุกสิ่งทุกอย่างด้วยตัวเองเช่นกัน ดังคำพูดของเดอะร็อคที่ว่า]")
    
    st.title(":red[Ariana Grande]")
    st.image("ed(4).jpg")
    st.markdown(":red[ประวัติ Ariana Grande]")
    st.markdown(":red[ชื่อจริง  Ariana Grande-Butera]")
    st.markdown(":red[ชื่อในวงการ : Ariana Grande]")
    st.markdown(":red[วันเดือนปีเกิด : 26 มิถุนายน พ.ศ. 2536 ในเมืองโบกาเรตัน รัฐฟลอริดา ประเทศสหรัฐอเมริกา]")
    st.markdown(":red[อะรีอานา กรานเด-บูเทรา เกิดเมื่อวันที่ 26 มิถุนายน พ.ศ. 2536 ในเมืองโบกาเรตัน รัฐฟลอริดา เป็นลูกสาวของ โจน แกรนด์ และ เอ็ดเวิร์ด บูเตอรา และมีพี่ชายต่างบิดา ชื่อ แฟรงกี้ กรานเด เป็นนักแสดง นักเต้น และโปรดิวเซอร์. ครอบครัวของเธอนั้น เป็นชาวอเมริกันที่มีเชื้อสายจากอิตาลี.ครอบครัวของเธอแยกทางกัน ตอนที่เธออายุได้ประมาณ 8-9 ขวบ. ส่วนชื่อของเธอนั้นมีที่มาจาก เจ้าหญิงออเรียน่า จากเรื่อง เฟลิกซ์เดอะแคท.ตอนเด็กๆเธอเคยแสดงในโรงภาพยนตร์ของเด็กในฟลอลิดา เล่นบทบาทแรกของเธอในฐานะ Annieรวมทั้งการแสดงในละครเพลง พ่อมดแห่งเมืองออซและ โฉมงามกับเจ้าชายอสูร. และตอนอายุได้ 8 ปี, เธอได้ร้องเพลงร่วมกับวงออเคสต้า อย่างเช่น South Florida Philharmonic, Florida Sunshine Pops และ Symphonic Orchestras, และเธอได้ร้องเพลง “เดอะสตาร์สแปงเกิลด์แบนเนอร์ (เพลงชาติประจำสหรัฐ) ” ในรายการโทรทัศน์แห่งชาติ เพื่อทีมฮ็อคกี้ ฟลอริด้า แพนเธอร์ส[6] และเธอได้จบการศึกษาจาก Pine Crest Schoolและ North Broward Preparatory Schoolตอนอายุได้ 13 ปี, เธอเริ่มจริงจังกับอาชีพดนตรีมากขึ้น, แต่เธอก็ยังคงทำแสดงละครอยู่. เมื่อเธอมาถึงเมือง ลอสแอนเจลิสได้พบกับผู้จัดการของเธอ เธอตั้งใจจะทำอัลบั้มเพลงแนว  อาร์แอนด์บีตอนอายุ 14 ปี. ในปี ค.ศ. 2008, เธอเริ่มงานละครบรอดเวย์เรื่อง 13ซึ่งทำให้เธอได้รับรางวัล National Youth Theatre Association Award. เมื่อเธอได้เข้ามาทำงานด้านเพลง เธอก็ออกจากโรงเรียนมัธยม North Broward Preparatory Schoolแต่เธอก็ยังลงทะเบียนเรียนอยู่ แต่เรียนกับติวเตอร์. และเธอยังร้องเพลงหลายครั้งที่ร้าน เบิร์ดแลนด์ ใน นิวยอร์ก]")
    
    st.title(" :red[Kim Kardashian]")
    st.image("Kim-Kardashian_content-copy-8.jpg")
    st.markdown(":red[ก่อนจะมาเป็น Kim Kardashian มถือว่าโชคดีที่เธอเกิดและเติบโตในลอสแอนเจลิส ศูนย์กลางของวงการบันเทิงทุกภาคส่วน โดยคุณพ่อโรเบิร์ต คาร์ดาเชียน เป็นทนายความชื่อดังในคดีแห่งยุค 90s ของนักอเมริกันฟุตบอล โอ.เจ. ซิมป์สัน และคุณแม่ของเธอ คริส เจนเนอร์ ก็กำลังคบหากับ บรูซ เจนเนอร์ (ตอนนี้คือ เคทลิน เจนเนอร์) ที่เป็นนักกีฬาเหรียญทองโอลิมปิกชื่อดัง ซึ่งในตอนนั้นคิมก็เรียนที่โรงเรียนเอกชน Marymount High School ที่เธอเติบโตมากับก๊วนลูกดาราและคนฮอลลีวูด เช่น นิโคล ริชชี เป็นต้น ทั้งคู่ยังเคยจัดงานวันเกิดด้วยกันที่บ้านของไมเคิล แจ็คสันพอคิมเรียนมัธยมฯ จบเธอก็ตัดสินใจไม่เรียนมหาวิทยาลัยและทำงานเลย โดยเธอเริ่มเป็นสไตลิสต์จัดตู้เสื้อผ้าของดาราชื่อดังอย่าง เซเรนา วิลเลียมส์, ซินดี ครอว์ฟอร์ด และ ปารีส ฮิลตัน ซึ่งอะไรที่ลูกค้าเธออยากโละทิ้งเธอก็จะนำไปขายต่อทางเว็บไซต์ eBay เพื่อหากำไรมาในปี 2005 คิมก็เริ่มเป็นที่รู้จักในฐานะเพื่อนสนิทของ ปารีส ฮิลตัน ที่เธอเป็นสไตลิสต์ให้ด้วย โดยทั้งคู่มักจะออกไปเที่ยวช้อปปิ้ง กินข้าวและไปไนต์คลับทั่วลอสแอนเจลิส เพื่อให้เหล่าปาปารัซซีตามมาถ่ายรูป ซึ่งในตอนนั้นโซเชียลมีเดียก็เริ่มมีบทบาทและภาพของดาราก็กลายเป็น ‘สินค้า’ ขายดีเป็นอย่างมากแต่พอมาปี 2007 ชื่อเสียงของคิมก็ก้าวกระโดดหลังมีเซ็กซ์เทปออกมาที่ถ่ายกับแฟนหนุ่ม เรย์ เจ (น้องชายของนักร้อง แบรนดี้ ที่คิมเป็นสไตลิสต์ให้) ซึ่งคิมมีการฟ้องร้องค่าย Vivid Entertainment แต่ก็ตัดสินใจยุติคดีโดยได้เงินไกล่เกลี่ยมา 5 ล้านเหรียญสหรัฐ และยังคงได้ค่าลิขสิทธิ์ทุกปีเพราะยังขายได้ถล่มทลาย] ")
    
    st.title(":red[Beyoncé Giselle Knowles-Carter]")
    st.image("Beyoncé-บียอนเซ่.jpg")
    st.markdown(":red[บียอนเซ่ โนวส์  บียอนเซ่ จิเซลล์ โนวส์ (Beyoncé Giselle Knowles) เกิดเมื่อวันที่ 4 กันยายน ค.ศ. 1981 เป็นนักร้องสไตล์อาร์แอนด์บี, นักแต่งเพลง, โปรดิวเซอร์, นักแสดง และ นางแบบ ชาวอเมริกัน เธอเกิดและเติบโตที่ฮิวส์ตัน รัฐเท็กซัส ในวัยเด็กบียอนเซ่ได้เข้าร่วมในการแสดงหลากหลายเรียนอนุบาลถึงประถม ซึ่งรวมไปถึงการร้องเพลง อันเป็นการปูทางสำหรับอาชีพการเป็นนักร้อง บียอนเซ่เริ่มมีชื่อเสียงเป็นที่รู้จักในช่วงปี 1990 ในฐานะสมาชิกคนสำคัญของDestiny’s Childวงดนตรีหญิงล้วนแนวอาร์แอนด์บีชื่อดังในยุคนั้น ตลอดชีวิตการทำงานของเธอ มียอดขายเกินกว่า 100 ล้านชุดในฐานะศิลปินเดียว ในเดือนมิถุนายน ค.ศ. 2003 ระหว่างการพักงานของDestiny’s Childได้ออกอัลบั้มในฐานะศิลปินเดี่ยวเป็น ครั้งแรกกับ  อัลบั้มDangerously in love ซึ่งนับเป็นอัลบั้มที่ประสบความสำเร็จมากที่สุดอัลบั้มหนึ่งในปีนั้น อัลบั้มนี้ประสบความสำเร็จทั้งในด้านยอดขายและด้านคำวิจารณ์ต่างๆ ทำให้มีเพลงฮิตเช่นเพลง “Crazy in love”, “Baby Boy” และได้รับรางวัลแกรมมีถึง 5 สาขา จนต่อมาDestiny’s Childก็ได้ตัดสินใจแยกวงจากเป็นทางการ หลังจากนั้น เธอก็ได้มีอัลบั้มชุดที่สอง นั่นก็คืออัลบั้มB’Day วางขายในปี ค.ศ. 2006 ซึ่งเปิดตัวอันดับ 1 บนชาร์ตบิลบอร์ด มีซิงเกิลฮิตอย่าง “Deja Vu”, “Irreplaceable”, และ “Beautiful Liar” อัลบั้มเดี่ยวชุดที่ 3 ของเธอI Am… Sasha Fierce ได้วางจำหน่ายในเดือนพฤศจิกายน ค.ศ. 2008 มีซิงเกิลฮิต เช่น “If i were a boy”, “Single ladies (Put the ring on it)”, “Halo”, และ “Sweet Dream” บีย่องเซ่มีซิงเกิลที่ติดอันดับ 1 อยู่ทั้งหมด 5 เพลงด้วยกัน ทำให้เธอเป็นหนึ่งในสองศิลปินหญิงที่มีเพลงติดอันดับหนึ่งมากที่สุดในช่วงคริสต์ศตวรรษที่ 2000จากความสำเร็จอย่างสูงของการเป็นศิลปินเดี่ยวของบีย่องเซ่ ทำให้เธอได้รับการยกย่องให้เป็นศิลปินคนสำคัญคนหนึ่งของอุตสาหกรรมดนตรีในยุคปัจจุบัน และเธอก็ยังขยายงานอาชีพของเธอไปสู่งานทางการแสดงและเซ็นสัญญากับบริษัทสินค้าต่างๆ เธอได้เริ่มอาชีพทางการแสดงของเธอเมื่อปี ค.ศ. 2001 ใน ภาพยนตร์เพลงเรื่อง Carmen: A Hip Hopera ในปี ค.ศ. 2006 เธอได้รับบทนำในภาพยนตร์ทำใหม่ของละครบรอดเวย์ปี 1981 เรื่อง ‘DREAM GIRLS’ และทำให้เธอได้เข้าชิงรางวัลลูกโลกทองคำถึง 2 รางวัล บีย่องเซ่ได้มีธุรกิจสายงานแฟชั่นที่เธอได้ร่วมกับครอบครัว โดยใช้ชื่อว่า “House of Deréon” และได้เซ็นสัญญาเป็นพรีเซ็นเตอร์ให้กับบริษัทต่างๆ เช่น เป๊ปซี่, ทอมมี ฮิลฟิกเจอร์, อาร์มานิ และลอเรอัล และในปี ค.ศ. 2009 นี้ นิตยสารฟอร์บยังได้จัดอันดับให้เธออยู่ในอันดับ 4 ของคนดังที่มีอิทธิพลมากที่สุด, อันดับ 3 ของนักดนตรีที่มีรายได้มากที่สุด, และอันดับหนึ่งของคนดังอายุต่ำกว่า 30 ที่มีรายได้มากที่สุด ด้วยรายได้กว่า 87 ล้านดอลลาร์สหรัฐระหว่างปี ค.ศ. 2008 – ค.ศ. 2009]")
    
    st.title(":[redKhloé Kardashian]")
    st.image("330px-Khloe_Kardashian_2009.jpg")
    st.markdown(":red[Khloé Alexandra Kardashian ป็นบุคคลที่มีบุคลิกด้านสื่อ นักสังคมสงเคราะห์ และนางแบบชาวอเมริกัน เธอมีชื่อเสียงจากการแสดงร่วมกับครอบครัวในซีรีส์เรียลลิตีทีวี เรื่อง Keeping Up with the Kardashiansตั้งแต่ปี 2550 ถึง 2564 ความสำเร็จนำไปสู่การสร้างภาคแยกรวมถึงKourtney และKhloé Take Miami (2552–2556) และKourtney และKhloé Take เดอะแฮมป์ตันส์ (2014–2015) หลังจากจบการแสดงก่อนหน้านี้ เธอและครอบครัวของเธอก็เริ่มแสดงในรายการThe KardashiansของHuluในปี 2022ตั้งแต่เดือนกันยายน 2552 ถึงธันวาคม 2559 Kardashian แต่งงานกับนักบาสเกตบอลLamar Odomซึ่งเธอแต่งงานหนึ่งเดือนหลังจากพบกันครั้งแรก พวกเขาแสดงในซีรีส์เรียลลิตีทีวีของตนเองเรื่องKhloé & Lamar (2554–2555) ในปี 2009 คาร์ดาเชียนเข้าร่วมในรายการThe Celebrity Apprentice ซีซั่น ที่สองโดยเข้าชิงอันดับที่ 10 จากผู้สมัคร 16 คนจากการถูกโดนัลด์ ทรัมป์ ไล่ออก ในปี 2012 เธอร่วมเป็นเจ้าภาพซีซันที่สองของการดัดแปลงThe X Factor ในสหรัฐอเมริกา ร่วมกับนักแสดงมาริ โอ โลเปซKardashian มีส่วนร่วมในอุตสาหกรรมค้าปลีกและแฟชั่นร่วมกับน้องสาวของเธอKourtneyและKim พวกเขาได้เปิดตัวคอลเลกชันเสื้อผ้าและน้ำหอมหลายรายการ และยังออกหนังสือKardashian Konfidentialในปี 2010 พนักงานบูติกของ Dashได้ร่วมแสดงในซีรีส์เรียลลิตีทีวีเรื่องสั้นของพวกเขาเองDash Dolls (2015)ในปี 2559 Kardashian เป็นเจ้าภาพจัดรายการทอล์คโชว์ของเธอเองKocktails กับ Khloé เธอแสดงและอำนวยการสร้างสารคดีชุดด้านสุขภาพและฟิตเนสRevenge Body ร่วมกับโคลเอ คาร์ดาเชียน] ")
    
    st.title(":red[Kendall Jenner]")
    st.image("1915974-500w.jpg")
    st.markdown(":red[Kendall Jenner เริ่มต้นอาชีพนางแบบตั้งแต่อายุเพียง 14 ปีเท่านั้น เมื่อเธอบอกความต้องการนั้นกับแม่ของเธอผ่านรายการ Keeping Up with the Kardashians ซึ่ง Kris Jenner ได้พาเธอไปเซ็นสัญญากับเอเจนซี Wilhelmina Models เพื่อสานฝันอาชีพนางแบบ โดย Kendall Jenner มีโอกาสได้ร่วมงานกับแบรนด์ Forever 21 ได้ขึ้นปกแมกกาซีน American Cheerleader และ Seventeen รวมถึงได้เดินแบบครั้งแรกให้กับแบรนด์ Sherri Hill ในปี 2012 โดยมีพี่สาว Kim Kardashian คอยให้กำลังใจและตามรับ-ส่งเธอตลอดเวลา เธอเคยให้สัมภาษณ์ถึงสาเหตุที่อยากเป็นนางแบบ เพราะต้องการสร้างอาชีพและค้นหาตัวเองนอกจากการเป็นแค่คนดังจากเรียลิตี้โชว์เท่านั้น อาชีพของเธอเริ่มต้นจริงๆ ในปี 2014 เมื่อเธอตัดสินใจเซ็นสัญญากับเอเจนซีใหม่ Society Management ไม่นานนักเธอได้เดินแบบให้กับแบรนด์ Marc Jacobs ซึ่งถือเป็นไฮแฟชั่นแบรนด์แรกที่จ้างเธอ โดยเธอสร้างเฮดไลน์บนรันเวย์จากการปรากฏตัวในเสื้อซีทรูที่เผยให้เห็นหน้าอกของเธอ ในปีนั้น Kendall Jenner เดินให้กับแบรนด์ Tommy Hilfiger, Balmain, Chanel และอีกมากมาย ก่อนจะปิดปีด้วยการเซ็นสัญญากับค่ายบิวตี้ยักษ์ใหญ่อย่าง Estée Lauder ในฐานะ Global Brand Ambassadorด้วยชื่อเสียงจากรายการเรียลิตี้และยอดผู้ติดตามบนโซเชียลมีเดีย ทำให้เธอได้รับความสนใจเป็นวงกว้าง เพราะบางแบรนด์เริ่มจ้างนางแบบจากยอดผู้ติดตามแทนการแคสติ้งปกติ จนเกิดเป็นข้อพิพาทตามมาว่าเธอนั้นไม่ได้เป็นนางแบบที่ดีเลย แต่แค่ดังจากเรียลิตี้และโซเชียลมีเดีย หลายคนขนานนามว่าเธอนั้นเป็นแค่ Instamodel เท่านั้น อย่างไรก็ตาม ตลอดระยะเวลาหลายปี Kendall Jenner ยังสามารถคงสถานะนางแบบระดับโลกที่มีผลงานอยู่ตลอด แน่นอนว่ามันมาจากความอุตสาหะที่เธอต้องการพิสูจน์ตัวเองให้ทุกคนเห็นว่าเธอตั้งใจอยากจะเป็นนางแบบมืออาชีพจริงๆ แม้จะถูกด้อยค่าว่าเป็นแค่ Instamodel เท่านั้น แต่ Kendall Jenner และบ้าน Kardashian ช่วยสร้างธุรกิจการเป็นอินฟลูเอนเซอร์ผ่านโซเชียลมีเดีย และยังตระหนักถึงอำนาจของโลกออนไลน์ที่ปัจจุบันกลายเป็นต้นแบบของนางแบบรุ่นหลังๆ ที่หันมาใช้โซเชียลมีเดียสร้างกระบอกเสียงของตัวเองกันทั้งนั้น ด้วยยอดผู้ติดตามล่าสุดสูงถึง 263 ล้านฟอลโลเวอร์บน Instagram โดย Kendall Jenner ติดอันดับ 10 ของคนดังที่ทำรายได้สูงจากการโพสต์รูปโฆษณามากกว่า 1.2 ล้านดอลลาร์สหรัฐต่อ 1 โพสต์เท่านั้น ในปี 2018 เธอโค่นตำแหน่ง Gisele Bündchen ซูเปอร์โมเดลรุ่นพี่ ขึ้นแท่นนางแบบที่ทำรายได้สูงที่สุดต่อปีซึ่งจัดทำโดยนิตยสาร Forbes ด้วยตัวเลขประมาณการอยู่ที่ 22.3 ล้านดอลลาร์สหรัฐ และตำแหน่งนี้เธอยังถือครองจวบจนปัจจุบันด้วยรายรับที่มากขึ้นทุกปี พิสูจน์ความเป็นที่ต้องการและอิทธิพลของเธอที่มีต่อป๊อปคัลเจอร์และวงการแฟชั่นเป็นอย่างมาก]  ")
    
#3--------------------------------------------------------------------------------------------------------------------------------------------------
with tab3:
    age = st.slider('How old are you?', 0, 100, 25)
    st.write("I'm ", age, 'years old')
